In [1]:
from numpy.random import randn
import numpy as np
np.random.seed(123)
import os
import matplotlib.pyplot as plt
import pandas as pd
plt.rc('figure', figsize=(10, 6))
np.set_printoptions(precision=4)
pd.options.display.max_rows = 20

In [10]:
df1 = pd.DataFrame([[1, 5], [10, 6]], 
                 index = list('ab'), 
                 columns = list('AB'))
df1

    A  B
a   1  5
b  10  6

In [9]:
df2 = pd.DataFrame([[1, 6], [20, 7]], 
                 index = list('ac'), 
                 columns = list('AC'))
df2

    A  C
a   1  6
c  20  7

In [21]:
df1.merge(df2)

   A  B  C
0  1  5  6

In [22]:
df1.merge(df2, how='outer')

    A    B    C
0   1  5.0  6.0
1  10  6.0  NaN
2  20  NaN  7.0

In [27]:
df1

    A  B
a   1  5
b  10  6

In [25]:
df2

    A  C
a   1  6
c  20  7

In [28]:
df1.join(df2, rsuffix='_r')

    A  B  A_r    C
a   1  5  1.0  6.0
b  10  6  NaN  NaN

In [29]:
df1.join(df2, how='right', rsuffix='_r')

     A    B  A_r  C
a  1.0  5.0    1  6
c  NaN  NaN   20  7

In [30]:
df1.join(df2, how='inner', rsuffix='_r')

   A  B  A_r  C
a  1  5    1  6

In [31]:
df1.join(df2, how='outer', rsuffix='_r')

      A    B   A_r    C
a   1.0  5.0   1.0  6.0
b  10.0  6.0   NaN  NaN
c   NaN  NaN  20.0  7.0

In [35]:
df1

    A  B
a   1  5
b  10  6

In [36]:
df2

    A  C
a   1  6
c  20  7

In [38]:
pd.concat([df1, df2]) #suffixes = ['_l', '_r']

    A    B    C
a   1  5.0  NaN
b  10  6.0  NaN
a   1  NaN  6.0
c  20  NaN  7.0

In [39]:
df1.append(df2)

    A    B    C
a   1  5.0  NaN
b  10  6.0  NaN
a   1  NaN  6.0
c  20  NaN  7.0

In [40]:
pd.concat([df1, df2], axis=0)

    A    B    C
a   1  5.0  NaN
b  10  6.0  NaN
a   1  NaN  6.0
c  20  NaN  7.0

In [41]:
pd.concat([df1, df2], join='inner')

    A
a   1
b  10
a   1
c  20

In [32]:
df1

    A  B
a   1  5
b  10  6

In [33]:
df1.reset_index()

  index   A  B
0     a   1  5
1     b  10  6

In [34]:
df1.set_index('A')

    B
A
1   5
10  6

In [12]:
df1.join(df2)

ValueError: columns overlap but no suffix specified: Index(['A'], dtype='object')